app/controllers/duties_controller.rb

SELECT "duties".* FROM "duties"
---
  def index
    @duties = Duty.all()

SELECT "duties".* FROM "duties" WHERE "duties"."id" = $1 LIMIT 1  [["id", "style"]]
---
  def show
    @duty = Duty.find(params[:id])

INSERT INTO "duties" ("created_at", "description", "title", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Sun, 18 Mar 2012 04:53:35 UTC +00:00], ["description", "clean it"], ["title", "kitchen"], ["updated_at", Sun, 18 Mar 2012 04:53:35 UTC +00:00]]
---
  def create
    @duty = Duty.new(params[:duty])
    @duty.assigned_user = current_user
    respond_to do |format|
      if @duty.save