app/controllers/events_controller.rb

INSERT INTO "events" ("created_at", "description", "end_date", "formality_lvl", "location", "owner", "start_date", "title", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @event = Event.new(params[:event])

    respond_to do |format|
      if @event.save